In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
titanic = pd.read_csv('Titanic.csv',delimiter = ',',encoding = "utf-8")
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# 2. ¿Cuántas columnas (features) tiene?¿Cuáles son sus nombres?¿Y cuántas filas (instancias)?.
filas, columnas = titanic.shape
print("El archivo tiene {} filas(instancias) y {} columnas.".format(filas,columnas))
print(titanic.columns)

El archivo tiene 891 filas(instancias) y 12 columnas.
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
# 3. ¿Cuántos valores faltantes hay en cada columna?
titanic.isna().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [9]:
faltantes = titanic.isna().sum().sort_values(ascending=False)
faltantes[faltantes > 0]

Cabin       687
Age         177
Embarked      2
dtype: int64

In [11]:
# 4. ¿Cuál o cuáles son las columnas con más valores faltantes?
titanic.isna().sum().idxmax()

'Cabin'

In [15]:
# registro con mas faltantes
titanic.iloc[titanic.isna().sum(axis=1).idxmax()]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [18]:
# 5. Hacerse alguna pregunta acerca del dataset e intentar responderla. Por ejemplo, ¿cuál es la persona de más edad?
titanic.iloc[titanic.Age.idxmax()]
# titanic.iloc[titanic["Age"].idxmax()] #ESTO ES SIMILAR A LO ANTERIOR

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

In [23]:
# obtengo solo el nombre del pasajero mas viejo
titanic.iloc[titanic.Age.idxmax()]["Name"]

'Barkworth, Mr. Algernon Henry Wilson'

In [29]:
# repetimos proceso con el mas joven
titanic.iloc[titanic.Age.idxmin()]["Name"]

'Thomas, Master. Assad Alexander'

In [31]:
## Trabajando con datos faltantes

# Antes de realizar cada una de las siguientes consignas, recordá copiar el dataset en una nueva variable, 
# así mantemos el dataset original sin modificar.

titanic_copia = titanic.copy()
titanic_copia.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [33]:
# 1. Descartar aquellas filas que tengan algún valor faltante. ¿Cuántas instancias quedan en el dataset?
print("Cantidad de Registros antes del borrado: ", titanic_copia.shape[0])
titanic_copia.dropna(axis=0, inplace=True)
print("Cantidad de Registros Despues del borrado: ", titanic_copia.shape[0])

Cantidad de Registros antes del borrado:  891
Cantidad de Registros Despues del borrado:  183

In [61]:
titanic_copia = titanic.copy()

In [43]:
# 2. Descartar aquellas columnas que tengan algún valor faltante. ¿Cuántos y cuáles atributos quedaron?
print("Previo al borrado, tenemos {} filas y {} columnas.".format(titanic_copia.shape[0],titanic_copia.shape[1]))
titanic_copia.dropna(axis=1, inplace=True)
print("Posterior al borrado, tenemos {} filas y {} columnas.".format(titanic_copia.shape[0],titanic_copia.shape[1]))

Previo al borrado, tenemos 891 filas y 12 columnas.
Posterior al borrado, tenemos 891 filas y 9 columnas.

In [62]:
# 3. Descartar aquellas filas que tengan más de tres valores faltantes. ¿Cuántas instancias quedaron?
titanic_copia = titanic.copy()
print("Previo al borrado, tenemos {} filas y {} columnas.".format(titanic_copia.shape[0],titanic_copia.shape[1]))
titanic_copia.dropna(thresh=3, inplace=True)
print("Posterior al borrado, tenemos {} filas y {} columnas.".format(titanic_copia.shape[0],titanic_copia.shape[1]))

Previo al borrado, tenemos 891 filas y 12 columnas.
Posterior al borrado, tenemos 891 filas y 12 columnas.

In [63]:
# 4. Descartar aquellas columnas que tengan más del 50% de valores faltantes. ¿Cuántos y cuáles atributos quedaron? 
# Luego, descartar las instancias que tengan algún valor faltante.
titanic_copia = titanic.copy()
print("Previo al borrado, tenemos {} filas y {} columnas.".format(titanic_copia.shape[0],titanic_copia.shape[1]))
titanic_copia.dropna(axis=1, inplace=True, thresh=titanic_copia.shape[0]*0.5)
print("Posterior al borrado, tenemos {} filas y {} columnas.".format(titanic_copia.shape[0],titanic_copia.shape[1]))

Previo al borrado, tenemos 891 filas y 12 columnas.
Posterior al borrado, tenemos 891 filas y 11 columnas.

In [67]:
# 1. Calcular el valor medio, moda, mediana y la desviación estándar de la columna `price`.
print(titanic.Age.mean())
print(titanic.Age.mode()[0])
print(titanic.Age.median())
print(titanic.Age.std())

29.69911764705882
24.0
28.0
14.526497332334042

In [74]:
# 2. Imputar los valores faltantes en la columna `Age` usando su valor medio.
titanic_copia = titanic.copy()
print("Cantidad de nulos previo al FILL: ", titanic_copia.Age.isna().sum())
titanic_copia.Age.fillna(titanic_copia.Age.median(),inplace=True)
print("Cantidad de nulos posterior al FILL: ", titanic_copia.Age.isna().sum())

Cantidad de nulos previo al FILL:  177
Cantidad de nulos posterior al FILL:  0